Repository: manada00/smartapp
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Smart Food
ar: سمارت فود

source: Home
ar: الرئيسية

source: Categories
ar: التصنيفات

source: Orders
ar: الطلبات

source: Plans
ar: الخطط

source: Profile
ar: حسابي

source: Account
ar: الحساب

source: Edit Profile
ar: تعديل الملف الشخصي

source: Health Goals
ar: الأهداف الصحية

source: Dietary Preferences
ar: التفضيلات الغذائية

source: Daily Routine
ar: الروتين اليومي

source: Order History
ar: سجل الطلبات

source: Addresses
ar: العناوين

source: Manage Addresses
ar: إدارة العناوين

source: Payments
ar: الدفع

source: Payment Methods
ar: طرق الدفع

source: My Wallet
ar: المحفظة

source: Rewards
ar: المكافآت

source: My Points & Rewards
ar: نقاطي ومكافآتي

# referFriend
source: Refer a Friend
ar: ادعُ صديقاً

source: Settings
ar: الإعدادات

source: Notifications
ar: الإشعارات

source: App Theme
ar: مظهر التطبيق

source: Language
ar: اللغة

source: Support
ar: الدعم

source: Help Center
ar: مركز المساعدة

source: Contact Us
ar: تواصل معنا

source: Report Issue
ar: الإبلاغ عن مشكلة

source: Legal
ar: قانوني

source: Terms of Service
ar: شروط الاستخدام

source: Privacy Policy
ar: سياسة الخصوصية

source: About
ar: حول التطبيق

source: Log Out
ar: تسجيل الخروج

source: Version
ar: الإصدار

source: User Name
ar: اسم المستخدم

# goldPoints
source: Gold • 2,500 points
ar: ذهبي • ٢٥٠٠ نقطة

source: Select Language
ar: اختر اللغة

source: Good morning
ar: صباح الخير

source: Good afternoon
ar: مساء الخير

source: Good evening
ar: مساء الخير

source: Sweet dreams
ar: أحلام سعيدة

source: Start your day right
ar: ابدأ يومك بشكل صحي

source: Time to recharge
ar: حان وقت استعادة النشاط

source: Wind down with something good
ar: اختم يومك بوجبة مناسبة

# lightBiteBeforeBed
source: A light bite before bed?
ar: وجبة خفيفة قبل النوم؟

source: Set delivery address
ar: حدد عنوان التوصيل

# homeHeroTitle
source: Household needs, from bread to everything
ar: كل احتياجات البيت من الخبز لكل شيء

# homeHeroSubtitle
source: Fast shopping experience with fresh picks and top deals.
ar: تجربة تسوق سريعة مع اختيارات طازجة وعروض مميزة.

# quickActionReorder
source: Reorder
ar: إعادة الطلب

# quickActionFavorites
source: Favorites
ar: المفضلة

# quickActionSpecials
source: Specials
ar: العروض

# howDoYouWantToFeel
source: How do you want to feel today?
ar: كيف تحب أن تشعر اليوم؟

# howDoYouWantToFeelSubtitle
source: Choose a mood and we will guide your next meal.
ar: اختر حالتك وسنرشدك لوجبتك القادمة.

source: Browse by Category
ar: تصفح حسب التصنيف

source: Popular Right Now
ar: الأكثر طلباً الآن

source: See All
ar: عرض الكل

source: Recommended now
ar: موصى به الآن

# errorPrefix
source: Error
ar: خطأ

source: Search for meals...
ar: ابحث عن الوجبات...

# itemsCount
source: {count} items
ar: {count} عنصر

source: All
ar: الكل

source: High Protein
ar: بروتين عالي

source: Low Carb
ar: كربوهيدرات أقل

source: Under 150 EGP
ar: أقل من 150 جنيه

# quickUnder15Min
source: Quick < 15min
ar: سريع أقل من 15 دقيقة

source: Perfect for you
ar: مناسب لك جداً

# perfectForYouSubtitle
source: These match exactly what your body needs
ar: هذه الخيارات تناسب احتياج جسمك حالياً

source: Also great choices
ar: خيارات ممتازة أيضاً

# alsoGreatChoicesSubtitle
source: Solid options that support your goals
ar: اختيارات قوية تدعم أهدافك

source: Maybe not right now
ar: قد لا تكون مناسبة الآن

# maybeNotRightNowSubtitle
source: These might not be the best fit today
ar: ربما ليست الأنسب لك اليوم

# addedToCart
source: {name} added to cart
ar: تمت إضافة {name} إلى السلة

source: View Cart
ar: عرض السلة

# reviewsCount
source: {rating} ({count} reviews)
ar: {rating} ({count} تقييم)

# readyInMin
source: Ready in {minutes} min
ar: جاهز خلال {minutes} دقيقة

source: Best For
ar: مناسب لـ

source: Portion Size
ar: حجم الحصة

source: Popular
ar: الأكثر شيوعاً

# extraCost
source: +EGP {price}
ar: +{price} جنيه

source: Special Instructions
ar: ملاحظات خاصة

# specialInstructionsHint
source: Any allergies or preferences?
ar: هل لديك حساسية أو تفضيلات؟

source: Quantity
ar: الكمية

# addToCartPrice
source: Add to Cart • EGP {price}
ar: أضف للسلة • {price} جنيه

# greatPickForMorning
source: Great pick for the morning
ar: اختيار ممتاز للصباح

source: Keeps you full longer
ar: يشعرك بالشبع لفترة أطول

source: Perfect before bedtime
ar: مناسب قبل النوم

source: Gentle on your stomach
ar: خفيف على المعدة

source: Helps you stay focused
ar: يساعدك على التركيز

source: Keeps you full
ar: يشعرك بالشبع

source: Steady energy
ar: طاقة مستقرة

source: Easy to digest
ar: سهل الهضم

source: Good before sleep
ar: مناسب قبل النوم

source: Focus support
ar: يدعم التركيز

source: Workout fuel
ar: وقود للتمرين

source: Boost my energy
ar: أريد طاقة أكثر

# needSomethingFilling
source: I need something filling
ar: أريد وجبة مشبعة

# keepItLight
source: Keep it light for me
ar: أريد شيئاً خفيفاً

source: Refuel after training
ar: استعادة الطاقة بعد التمرين

source: Help me feel calm
ar: أريد الشعور بالهدوء

# easeHeaviness
source: Ease the heaviness
ar: تخفيف الإحساس بالثقل

source: Help me wind down
ar: ساعدني على الاسترخاء

source: Pick for my kid
ar: اختر لطفلي

# prepForFast
source: Prep for tomorrow’s fast
ar: استعداد لصيام الغد

source: Show me good options
ar: اعرض خيارات مناسبة

# staySharp
source: Stay sharp for the next few hours
ar: حافظ على تركيزك خلال الساعات القادمة

# balancedMealsSatisfy
source: Balanced meals that satisfy longer
ar: وجبات متوازنة تمنحك شبعاً أطول

# gentleChoicesEasy
source: Gentle choices that feel easy
ar: خيارات خفيفة ومريحة

# proteinRecovery
source: Protein-forward picks for recovery
ar: خيارات غنية بالبروتين للتعافي

# comfortSteadyEnergy
source: Comforting meals with steady energy
ar: وجبات مريحة بطاقة مستقرة

# softerOptions
source: Softer options to feel better soon
ar: خيارات ألطف لتشعر بتحسن سريع

# lighterDinners
source: Lighter dinners for a calmer night
ar: عشاء أخف لليلة أكثر هدوءاً

# kidsEnjoy
source: Nutritious meals kids actually enjoy
ar: وجبات مغذية يحبها الأطفال

# preFastMeals
source: Smart pre-fast meals for steady fuel
ar: وجبات ذكية قبل الصيام لطاقة ثابتة

# exploreByMood
source: Explore all recommendations by mood
ar: استكشف التوصيات حسب حالتك

# balancedCarbsProtein
source: Balanced carbs + protein to avoid crashes.
ar: كربوهيدرات متوازنة مع بروتين لتجنب الهبوط المفاجئ.

# fullnessPortion
source: Curated for fullness and better portion control.
ar: مختارة للشبع الأفضل والتحكم في الحصص.

# lowerHeaviness
source: Lower heaviness so you can stay comfortable.
ar: أقل ثقلاً لتشعر براحة أكبر.

# recoveryFocused
source: Recovery-focused picks chosen by nutrition rules.
ar: خيارات للتعافي حسب أسس غذائية دقيقة.

# steadyMood
source: Steady choices selected to keep mood balanced.
ar: خيارات مستقرة لدعم المزاج.

# gentlerIngredients
source: Gentler ingredients chosen for easier digestion.
ar: مكونات ألطف لراحة الهضم.

# eveningFriendly
source: Evening-friendly meals to support better rest.
ar: وجبات مسائية تدعم نوماً أفضل.

# kidApproved
source: Kid-approved options with balanced nutrition.
ar: خيارات مناسبة للأطفال ومغذية.

# longLastingEnergy
source: Smart combinations for longer-lasting energy.
ar: تركيبات ذكية لطاقة تدوم أطول.

# exploreAllPaths
source: You can always explore all personalized paths.
ar: يمكنك دائماً استكشاف كل المسارات المناسبة لك.
